Jmeter Tips And Trics/Aggregate Report From CLI Test Plan.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.2.1">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Aggregate Report From CLI Test Plan" enabled="true">
      <stringProp name="TestPlan.comments">Step 1 : Add JMeterPlugins-Standard lib
        https://jmeter-plugins.org/downloads/old/

Step 2 : Run your test and get jtl file
Run From Jmeter Bin :
jmeter -n -t &quot;G:\jmeter Examples\apache-jmeter-5.2.1\Jmeter Workouts\Jmeter Tips And Trics\Aggregate Report From CLI Test Plan.jmx&quot; 
-l &quot;G:\jmeter Examples\apache-jmeter-5.2.1\Jmeter Workouts\Reports Saved\Aggregate Report.jtl&quot;

Step 3 : Use JMeterPluginsCMD.bat to generate aggregate csv result file from jtl file
Run From Jmeter EXT :

syntax:

JMeterPluginsCMD.bat --generate-csv &quot;location of csv file&quot; --input-jtl &quot;location of jtl file&quot; --plugin-type AggregateReport

Use JMeterPluginsCMD tool with Plugin Type = AggregateReport

References:
https://jmeter-plugins.org/wiki/JMeterPluginsCMD/
https://jmeter-plugins.org/downloads/old/
</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Users Thread" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">5</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">lifecharger.org</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">G:\jmeter Examples\apache-jmeter-5.2.1\Jmeter Workouts\Reports Saved\\${__time(MM-dd-YYYY HH-mm-ss)}Creating Aggregate Report File.csv</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>